src/cf/InformationRegisters/ArchiveOfExchangeMessages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ArchiveOfExchangeMessages</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>FullFileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Storage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReceivedMessageNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileExtention</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileSize</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsFileExceeds100MB</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TheHashSumOfTheFile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>InfobaseNode</Name>
					<Comment>ACC:1330 универсальный механизм</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ExchangeMessageArchiveSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ExchangeMessageArchiveSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>FilesCount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>StoreOnDisk</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FullPath</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ShouldCompressFiles</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>InfobaseNode</Name>
					<Comment>ACC:1330 универсальный механизм</Comment>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/DataExchangeResults.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>DataExchangeResults</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>OccurrenceDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Cause</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IsSkipped</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>DeletionMark</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObjectPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IndependentRegisterFiltersValues</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>IssueType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DataExchangeIssuesTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>InfobaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>MetadataObject</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ObjectWithIssue</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UniqueKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/DataExchangeIssuesTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>DataExchangeIssuesTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ApplicationAdministrativeError</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UnpostedDocument</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BlankAttributes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HandlersCodeExecutionErrorOnSendData</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HandlersCodeExecutionErrorOnGetData</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConvertedObjectValidationError</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IsExchangeMessageOutsideOfArchive</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ArchiveOfExchangeMessages/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

Procedure PackMessageToArchive(InfobaseNode, PathToSourceFile) Export
	
	If Not ValueIsFilled(InfobaseNode) Then
		Return;
	EndIf;
	
	SSLExchangePlans = DataExchangeCached.SSLExchangePlans();
	If SSLExchangePlans.Find(InfobaseNode.Metadata().Name) = Undefined Then
		Return;
	EndIf;
	
	Settings = InformationRegisters.ExchangeMessageArchiveSettings.GetSettings(InfobaseNode);
	
	If Settings = Undefined Or Settings.FilesCount = 0 Then
		Return;
	EndIf;
	
	BeginTransaction();
	
	Try
		
		PutToArchive(InfobaseNode, PathToSourceFile, Settings);
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		
		ErrorMessage = ErrorProcessing.DetailErrorDescription(ErrorInfo());
		
		WriteLogEvent(EventLogEventMessagePutToArchive(),
			EventLogLevel.Error, , , ErrorMessage);
		
		ReasonText = NStr("en = 'The file was not archived.'") + Chars.LF + ErrorMessage;
		
		WriteParameters = New Structure;
		WriteParameters.Insert("InfobaseNode", InfobaseNode);
		WriteParameters.Insert("Cause", ReasonText);
		WriteParameters.Insert("IssueType", Enums.DataExchangeIssuesTypes.IsExchangeMessageOutsideOfArchive);
		InformationRegisters.DataExchangeResults.AddAnEntryAboutTheResultsOfTheExchange(WriteParameters);
		
	EndTry;
	
EndProcedure 

#EndRegion

#Region Private

Procedure PutToArchive(InfobaseNode, PathToSourceFile, Settings)

	Block = New DataLock;
	LockItem = Block.Add("InformationRegister.ArchiveOfExchangeMessages");
	LockItem.SetValue("InfobaseNode", InfobaseNode);
	Block.Lock();
	
	Set = InformationRegisters.ArchiveOfExchangeMessages.CreateRecordSet();
	Set.Filter.InfobaseNode.Set(InfobaseNode);
	Set.Read();
	
	RecordsCount = Set.Count();
	For Cnt = 1 To RecordsCount Do
		
		IndexOf = RecordsCount - Cnt;
		Record = Set[IndexOf];
		If Record.IsFileExceeds100MB Then
			Set.Delete(IndexOf);
		EndIf;
		
	EndDo;
	
	For Cnt = 1 To Set.Count() - Settings.FilesCount + 1 Do
		
		Record = Set.Get(0);
		
		If Record.FullFileName <> "" Then
			DeleteFiles(Record.FullFileName);
		EndIf;
			
		Set.Delete(0);
		
	EndDo;
		
	If StrEndsWith(Lower(PathToSourceFile), "zip") Then
		FileExtention = "zip";
	Else
		FileExtention = "xml";
	EndIf;
	
	HashAmountOfExchangeMessages = "";
	
	If FileExtention = "zip" Then
		TempDirectoryName = GetTempFileName("");
		
		If DataExchangeServer.UnpackZipFile(PathToSourceFile, TempDirectoryName) Then
			UnpackedFileList = FindFiles(TempDirectoryName, GetAllFilesMask(), True);
			
			If UnpackedFileList.Count() Then
				BinaryDataExchangeMessages = New BinaryData(UnpackedFileList[0].FullName);
				HashAmountOfExchangeMessages = DataExchangeServer.HashAmountOfExchangeMessage(BinaryDataExchangeMessages);
			EndIf;
		EndIf; 
		
		DeleteFiles(TempDirectoryName);
	Else
		BinaryDataExchangeMessages = New BinaryData(PathToSourceFile);
		HashAmountOfExchangeMessages = DataExchangeServer.HashAmountOfExchangeMessage(BinaryDataExchangeMessages);
	EndIf;
	
	DeleteFileAfterPut = False;
	If Settings.ShouldCompressFiles And FileExtention <> "zip" Then
		
		DeleteFileAfterPut = True;
		FileExtention = "zip";
		FileName = GetTempFileName(FileExtention);
		
		DataExchangeServer.PackIntoZipFile(FileName, PathToSourceFile);
		
	Else
		
		FileName = PathToSourceFile;
		
	EndIf;
	
	File = New File(FileName);
	FileSize = File.Size() / (1024 * 1024); 
	
	Template = "%1_%2_%3";
	FileNameInArchive = StrTemplate(Template, 
		InfobaseNode.Code,
		InfobaseNode.ReceivedNo,
		String(New UUID));
	
	NewArchive = Set.Add();
	NewArchive.InfobaseNode = InfobaseNode;
	NewArchive.Period = CurrentSessionDate();
	NewArchive.ReceivedMessageNumber = InfobaseNode.ReceivedNo;
	NewArchive.FileSize = FileSize;
	NewArchive.FileName = FileNameInArchive;
	NewArchive.FileExtention = FileExtention;
	NewArchive.TheHashSumOfTheFile = HashAmountOfExchangeMessages;
	
	If Settings.StoreOnDisk Then
		
		Template = "%1%2.%3";
		
		FolderName = Settings.FullPath;
				
		FullFilenameInFolder = StringFunctions.FormattedString(Template,
			FolderName,
			FileNameInArchive,
			FileExtention);
			
		CopyFile(FileName, FullFilenameInFolder);
		NewArchive.FullFileName = FullFilenameInFolder;
			
	Else
				
		If Common.DataSeparationEnabled() And FileSize > 100 Then
			
			NewArchive.IsFileExceeds100MB = True;
			
			Cause = NStr("en = 'Exchange message larger than 100 MB. The file is not placed to the archive.'");
			WriteParameters = New Structure;
			WriteParameters.Insert("InfobaseNode", InfobaseNode);
			WriteParameters.Insert("Cause", Cause);
			WriteParameters.Insert("IssueType", Enums.DataExchangeIssuesTypes.IsExchangeMessageOutsideOfArchive);
			InformationRegisters.DataExchangeResults.AddAnEntryAboutTheResultsOfTheExchange(WriteParameters);
	
		Else
			
			NewArchive.Storage = New ValueStorage(New BinaryData(FileName));
			
		EndIf;
		
	EndIf;
	
	If DeleteFileAfterPut Then
		DeleteFiles(FileName);
	EndIf;
    
	Set.Write();
	
EndProcedure

Function EventLogEventMessagePutToArchive()
	
	Return NStr("en = 'Data exchange.Place message to archive'", Common.DefaultLanguageCode());
	
EndFunction

#EndRegion

#EndIf
